# Standardization

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("C:\\Users\\snehr\\Desktop\\Datasets for pandas (24-05-2024)_files\\placement.csv")

In [3]:
df.head(2)

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0

In [4]:
df.isnull().sum()### using thius method we  can check missing values in column in dataframe

cgpa            0
resume_score    0
placed          0
dtype: int64

In [9]:
x = df.drop(columns = ['placed'] , axis = 1)  ### Input data
y = df['placed']  ### Target data

In [10]:
from sklearn.model_selection import train_test_split

In [11]:
x_train , x_test , y_train , y_test = train_test_split(x,y,test_size = 0.2 , random_state = 42)

In [12]:
print("Total data shape = " , df.shape)
print("Independent data shape = " , x.shape)
print("Dependent data shape = " , y.shape)
print("X_train data shape = " , x_train.shape)
print("X_test data shape = " , x_test.shape)
print("y_train data shape = " , y_train.shape)
print("y_test data shape = " , y_test.shape)

Total data shape =  (100, 3)
Independent data shape =  (100, 2)
Dependent data shape =  (100,)
X_train data shape =  (80, 2)
X_test data shape =  (20, 2)
y_train data shape =  (80,)
y_test data shape =  (20,)

In [16]:
# np.round(x_train.describe() , 2

In [17]:
# Now we will apply Standardization so that we can convert our data into normal distribution . 

# mean = 0 
# standard deviation = 1

In [18]:
from sklearn.preprocessing import StandardScaler 

# mean = sum(xi)/frequency
# standard deviation = sum(squareroot(xi - mean)/Total Number of Elements)

# standardScaler = xi- mean / standard deviation 
# updated data ===> mean = 0  , standard deviation = 1

In [19]:
sc = StandardScaler()

In [20]:
x_train_sc = sc.fit_transform(x_train)   #### fit means learn the parameter and transform means 
# apply function on data .

In [21]:
x_train_new = pd.DataFrame(x_train_sc , columns = x_train.columns)

In [22]:
 x_train_new.head(3)

       cgpa  resume_score
0 -0.008602     -0.128926
1  1.001293     -0.925381
2 -0.607389     -0.527154

In [23]:
np.round(x_train_new.describe() , 2)

        cgpa  resume_score
count  80.00         80.00
mean   -0.00         -0.00
std     1.01          1.01
min    -1.50         -2.04
25%    -0.85         -0.72
50%    -0.29          0.15
75%     0.99          0.69
max     2.11          2.05

In [24]:
df = pd.read_csv("C:\\Users\\snehr\\Desktop\\python\\Social_Network_Ads.csv")

In [25]:
df.head(2)

    User ID Gender  Age  EstimatedSalary  Purchased
0  15624510   Male   19            19000          0
1  15810944   Male   35            20000          0

In [26]:
df = df.drop(columns = ['Gender'] , axis = 1)
df.head(3)

    User ID  Age  EstimatedSalary  Purchased
0  15624510   19            19000          0
1  15810944   35            20000          0
2  15668575   26            43000          0

In [27]:
df.isnull().sum()  ### for checking missing values sum in each column .

User ID            0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [28]:
x = df.drop(columns = ['Purchased'] , axis = 1) ### Input columns 
y = df['Purchased']  ## Target column

In [29]:
from sklearn.model_selection import train_test_split

In [30]:
x_train , x_test , y_train , y_test = train_test_split(x,y,test_size = 0.2 , random_state = 42)

In [31]:
np.round(x_train.describe() , 2)

           User ID     Age  EstimatedSalary
count       320.00  320.00           320.00
mean   15689066.37   37.87         70281.25
std       71974.25   10.21         34430.55
min    15569641.00   18.00         15000.00
25%    15622771.00   30.00         43000.00
50%    15689969.50   37.00         71000.00
75%    15747470.00   45.00         88000.00
max    15815236.00   60.00        150000.00

In [32]:
from sklearn.preprocessing import StandardScaler

In [33]:
sc = StandardScaler()

In [34]:
x_train_sc = sc.fit_transform(x_train)

In [35]:
x_train_new = pd.DataFrame(x_train_sc , columns = x_train.columns)

In [36]:
np.round(x_train_new.describe() , 2)

       User ID     Age  EstimatedSalary
count   320.00  320.00           320.00
mean      0.00   -0.00             0.00
std       1.00    1.00             1.00
min      -1.66   -1.95            -1.61
25%      -0.92   -0.77            -0.79
50%       0.01   -0.09             0.02
75%       0.81    0.70             0.52
max       1.76    2.17             2.32